GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F18046.inc
;==========================================================================
; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1      EQU  H'8007'
_CONFIG2      EQU  H'8008'
_CONFIG3      EQU  H'8009'
_CONFIG4      EQU  H'800A'
_CONFIG5      EQU  H'800B'
;==========================================================================
             ; C:\Users\admin\.mchp_packs\Microchip\PIC16F1xxxx_DFP\1.15.191\xc8\pic\dat\cfgdata\16F18046.cfgdata
;==========================================================================

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_ECH         EQU  H'3FFF'; EC (external clock) above 16 MHz
_FEXTOSC_ECL         EQU  H'3FFD'; EC (external clock) below 16 MHz
_FEXTOSC_OFF         EQU  H'3FFC'; Oscillator not enabled
_RSTOSC_EXTOSC       EQU  H'3FFF'; EXTOSC operating per FEXTOSC bits
_RSTOSC_HFINTOSC_1MHz EQU  H'3FEF'; HFINTOSC (1MHz)
_RSTOSC_LFINTOSC     EQU  H'3FDF'; LFINTOSC
_RSTOSC_SOSC         EQU  H'3FCF'; SOSC
_RSTOSC_HFINTOSC_32MHz EQU  H'3F8F'; HFINTOSC (32 MHz)
_CLKOUTEN_ON         EQU  H'3EFF'; CLKOUT function is enabled; FOSC/4 clock appears at OSC2
_CLKOUTEN_OFF        EQU  H'3FFF'; CLKOUT function is disabled; i/o or oscillator function on OSC2
_VDDAR_HI            EQU  H'3FFF'; Internal analog systems are calibrated for operation between VDD = 2.3 - 5.5V
_VDDAR_LO            EQU  H'2FFF'; Internal analog systems are calibrated for operation between VDD = 1.8 - 3.6V

;----- CONFIG2 Options --------------------------------------------------
_MCLRE_EXTMCLR       EQU  H'3FFF'; If LVP = 0, MCLR pin is MCLR; If LVP = 1, RA3 pin function is MCLR
_MCLRE_INTMCLR       EQU  H'3FFE'; If LVP = 0, MCLR is port-defined function; If LVP = 1, RA3 pin function is MCLR
_PWRTS_PWRT_OFF      EQU  H'3FFF'; PWRT is disabled
_PWRTS_PWRT_64       EQU  H'3FFD'; PWRT set at 64 ms
_PWRTS_PWRT_16       EQU  H'3FFB'; PWRT set at 16 ms
_PWRTS_PWRT_1        EQU  H'3FF9'; PWRT set at 1 ms
_WDTE_ON             EQU  H'3FFF'; WDT enabled regardless of Sleep; SEN bit is ignored
_WDTE_NSLEEP         EQU  H'3FF7'; WDT enabled when sleep = 0, suspended when Sleep = 1; SEN is ignored
_WDTE_SWDTEN         EQU  H'3FEF'; WDT enabled/disabled by SEN bit
_WDTE_OFF            EQU  H'3FE7'; WDT disabled; SEN is ignored
_BOREN_ON            EQU  H'3FFF'; Brown-out Reset enabled, SBOREN bit is ignored
_BOREN_NSLEEP        EQU  H'3FBF'; Brown-out Reset enabled while running, disabled in sleep; SBOREN is ignored
_BOREN_SBOREN        EQU  H'3F7F'; Brown-out reset enabled according to SBOREN bit
_BOREN_OFF           EQU  H'3F3F'; Brown-out reset disabled
_DACAUTOEN_OFF       EQU  H'3FFF'; DAC Buffer reference range is determined by the REFRNG bit
_DACAUTOEN_ON        EQU  H'3EFF'; DAC Buffer reference range is automatically determined by module hardware
_BORV_LO             EQU  H'3FFF'; Brown-out Reset Voltage (VBOR) set to 1.9V
_BORV_HI             EQU  H'3DFF'; Brown-out Reset Voltage (VBOR) is set to 2.85V
_ZCD_OFF             EQU  H'3FFF'; ZCD module is disabled; ZCD can be enabled by setting the ZCDSEN bit of ZCDCON
_ZCD_ON              EQU  H'3BFF'; ZCD module is always enabled; ZCDMD and ZCDSEN bits are ignored
_PPS1WAY_ON          EQU  H'3FFF'; The PPSLOCKED bit can be cleared and set only once after an unlocking sequence is executed; once PPSLOCKED is set, all future changes to PPS registers are prevented
_PPS1WAY_OFF         EQU  H'37FF'; The PPSLOCKED bit can be set and cleared as needed (unlocking sequence is required)
_STVREN_ON           EQU  H'3FFF'; Stack Overflow or Underflow will cause a reset
_STVREN_OFF          EQU  H'2FFF'; Stack Overflow or Underflow will not cause a reset

;----- CONFIG3 Options --------------------------------------------------

;----- CONFIG4 Options --------------------------------------------------
_BBSIZE_BB512        EQU  H'3FFF'; 512 words boot block size
_BBSIZE_BB1K         EQU  H'3FFE'; 1024 words boot block size
_BBSIZE_BB2K         EQU  H'3FFD'; 2048 words boot block size
_BBSIZE_BB4K         EQU  H'3FFC'; 4096 word boot block size
_BBSIZE_BB8K         EQU  H'3FFB'; 8192 word boot block size
_BBSIZE_BB16K        EQU  H'3FFA'; 16384 word boot block size
_BBSIZE_BB32K        EQU  H'3FF9'; * half of user program memory
_BBSIZE_BB64K        EQU  H'3FF8'; * half of user program memory
_BBEN_OFF            EQU  H'3FFF'; Boot Block disabled
_BBEN_ON             EQU  H'3FF7'; Boot Block enabled
_SAFEN_OFF           EQU  H'3FFF'; SAF disabled
_SAFEN_ON            EQU  H'3FEF'; SAF enabled
_WRTAPP_OFF          EQU  H'3FFF'; Application Block is NOT write protected
_WRTAPP_ON           EQU  H'3F7F'; Application Block is write protected
_WRTB_OFF            EQU  H'3FFF'; Boot Block is NOT write protected
_WRTB_ON             EQU  H'3EFF'; Boot Block is write protected
_WRTC_OFF            EQU  H'3FFF'; Configuration Register is NOT write protected
_WRTC_ON             EQU  H'3DFF'; Configuration Register is write protected
_WRTD_OFF            EQU  H'3FFF'; Data EEPROM is NOT write-protected
_WRTD_ON             EQU  H'3BFF'; Data EEPROM is write-protected
_WRTSAF_OFF          EQU  H'3FFF'; SAF is NOT write protected
_WRTSAF_ON           EQU  H'37FF'; SAF is write protected
_LVP_ON              EQU  H'3FFF'; Low Voltage programming enabled. MCLR/Vpp pin function is MCLR. MCLRE Configuration bit is ignored
_LVP_OFF             EQU  H'1FFF'; High Voltage on MCLR/Vpp must be used for programming

;----- CONFIG5 Options --------------------------------------------------
_CP_OFF              EQU  H'3FFF'; Program Flash Memory code protection is disabled
_CP_ON               EQU  H'3FFE'; Program Flash Memory code protection is enabled
_CPD_OFF             EQU  H'3FFF'; EEPROM code protection is disabled
_CPD_ON              EQU  H'3FFD'; EEPROM code protection is enabled

;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'8000'
_IDLOC1            EQU  H'8001'
_IDLOC2            EQU  H'8001'
_IDLOC3            EQU  H'8002'
_IDLOC4            EQU  H'8002'
_IDLOC5            EQU  H'8003'
_IDLOC6            EQU  H'8003'
_IDLOC7            EQU  H'8004'

        LIST
